contiki-os/contiki/cpu/cc26xx-cc13xx/rf-core/prop-mode.c
  case RADIO_PARAM_TXPOWER:
    if(value < TX_POWER_DRIVER[get_tx_power_array_last_element()].dbm ||
       value > OUTPUT_POWER_MAX) {
      return RADIO_RESULT_INVALID_VALUE;
    }

    soft_off_prop();

    set_tx_power(value);

    if(soft_on_prop() != RF_CORE_CMD_OK) {
      PRINTF("set_value: soft_on_prop() failed\n");
      rv = RADIO_RESULT_ERROR;
    }

    return RADIO_RESULT_OK;
  case RADIO_PARAM_RX_MODE:
      if(value & ~(RADIO_RX_MODE_POLL_MODE)) {
        return RADIO_RESULT_INVALID_VALUE;
      }
#ifndef RF_CORE_POLL_MODE
      poll_mode = (value & RADIO_RX_MODE_POLL_MODE) != 0;
    return RADIO_RESULT_OK;
#else
      if ( (poll_mode != 0) == ((value & RADIO_RX_MODE_POLL_MODE) != 0) )
          return RADIO_RESULT_OK;
      else
          return RADIO_RESULT_INVALID_VALUE;
#endif

  case RADIO_PARAM_TX_MODE:
    if(value & ~(RADIO_TX_MODE_SEND_ON_CCA)) {
      return RADIO_RESULT_INVALID_VALUE;
    }
    return set_send_on_cca((value & RADIO_TX_MODE_SEND_ON_CCA) != 0);

  case RADIO_PARAM_CCA_THRESHOLD:
    rssi_threshold = (int8_t)value;
    break;
  default:
    return RADIO_RESULT_NOT_SUPPORTED;
  }

  PRINTF("set_value: strange\n");
  return rv;
}
/*---------------------------------------------------------------------------*/
static radio_result_t
get_object(radio_param_t param, void *dest, size_t size)
{
    if(param == RADIO_PARAM_LAST_PACKET_TIMESTAMP) {
      if(size != sizeof(rtimer_clock_t) || !dest) {
        return RADIO_RESULT_INVALID_VALUE;
      }
      *(rtimer_clock_t *)dest = rf_rat_calc_last_rttime();

      return RADIO_RESULT_OK;
    }

  return RADIO_RESULT_NOT_SUPPORTED;
}
/*---------------------------------------------------------------------------*/
static radio_result_t
set_object(radio_param_t param, const void *src, size_t size)
{
  return RADIO_RESULT_NOT_SUPPORTED;
}
/*---------------------------------------------------------------------------*/
const struct radio_driver prop_mode_driver = {
  init,
  prepare,
  transmit,
  send,
  read_frame,
  channel_clear,
  receiving_packet,
  pending_packet,
  on,
  off,
  get_value,
  set_value,
  get_object,
  set_object,
};
/*---------------------------------------------------------------------------*/
/**
 * @}
 */
